app/views/types/show.html.erb

<div class="all-nonprofits">
  <% if @type.nonprofits.any? %>
    <% @type.nonprofits.each do |nonprofit| %>
---
SELECT "nonprofits".* FROM "nonprofits" WHERE "nonprofits"."type_id" = $1  [["type_id", 5]]
SELECT  1 AS one FROM "nonprofits" WHERE "nonprofits"."type_id" = $1 LIMIT $2  [["type_id", 5], ["LIMIT", 1]]