app/controllers/application_controller.rb

  def current_order
    # Order.find(1)
    if session[:order_id]
      Order.find(session[:order_id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]