app/controllers/carts_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
  def show
    @order_items = current_order.order_items