app/controllers/nonprofits_controller.rb

SELECT  "nonprofits".* FROM "nonprofits" WHERE "nonprofits"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
  def show
    @nonprofit = Nonprofit.find(params[:id])
    @order_item = current_order.order_items.new