app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("order_id", "amount", "created_at", "updated_at", "nonprofit_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 1], ["amount", 24], ["created_at", "2018-12-17 17:40:29.608844"], ["updated_at", "2018-12-17 17:40:29.608844"], ["nonprofit_id", 13]]
---
  def create
    @order = current_order
    @item = @order.order_items.new(item_params)
    @order.save

UPDATE "orders" SET "total" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total", 24], ["updated_at", "2018-12-17 17:40:29.606930"], ["id", 1]]
---
  def destroy
   @order = current_order
   @item = @order.order_items.find(params[:id])
   @item.destroy
   @order.save