app/controllers/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    @types = Type.all

SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
  def show
    @type = Type.find(params[:id])
    @order_item = current_order.order_items.new