app/models/order.rb

  def calculate_total
    self.order_items.collect { |item| item.amount }.sum
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]

  def calculate_total_cent
  self.order_items.collect { |item| item.amount }.sum * 100
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]