app/views/layouts/application.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
        </div>
        <a href="/cart" class="float-right"><%= image_tag ("cart.png"), :class => 'cart' %><span class="badge badge-pill badge-secondary"><%= current_order.order_items.length %></span></a>